---
kind: type
id: T:Autodesk.Revit.DB.DWGExportOptions
source: html/3e510f02-1a4c-3e4f-f923-e96972d03862.htm
---
# Autodesk.Revit.DB.DWGExportOptions

The export options used by exporting DWG format file.

## Syntax (C#)
```csharp
public class DWGExportOptions : ACADExportOptions
```